Revit 2024 API
AssetProperty.IsValidSchemaIdentifier Method
 Check that schema name is valid
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public bool IsValidSchemaIdentifier(
	string schemaID
)
Visual Basic
Public Function IsValidSchemaIdentifier ( _
	schemaID As String _
) As Boolean
Visual C++
public:
bool IsValidSchemaIdentifier(
	String^ schemaID
)
Parameters
schemaID
Type: System.String
 The schema name.
Return Value
 True if the schema name is valid.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace